// let i = 1;

// while (i <=2) {
//     console.log('Привет');
//     i++
// }


// let i = 1;

// while (i <= 5) {
//     console.log(i);
//     i++
// }


// let i = 7;

// while (i <= 22) {
//     console.log(i);
//     i++
// }


// let obj = {
//     'Коля': '200',
//     'Вася': '300',
//     'Петя': '400',
// }

// for (let key in obj) {
//     console.log(`${key}, зарплата ${obj[key]}`);
// }


// for (let n = 1000, num = 0; n > 50; num++) {
//     n /= 2;
//     alert(n)
    
// }    (не понимаю что у меня получилсоь, сложно даются задачки, скатал с интерента((((((())))))))


// for (let i = 1; i <= 31; i += 7) {

//     console.log(`Сегодня пятница ${i}-е число. Необходимо подготовить отчет.  `);
  
//   }